!!False
!!True
!!\<alpha>
!!a0
!!current
!!fix
!!isptr
!!next
!!visited
!-inv-l
!-inv-r
!=a
!=hap
!=i
!=set0
!A
!A-numi
!A-sym-fold-to-stvi
!A-sym-foldi
!A-symi
!A1
!AffineMap
!Ant
!ContainsS
!E
!E1
!E2
!EOF?
!Gamma
!HasMorExt
!I
!Is0Bifunctor
!Is0Functor
!Is1Bifunctor
!Is1Functor
!Is1Natural
!IsDGraph
!IsEquiv
!IsFailure
!IsLowerTriangular
!IsNormalSubgroup
!IsSemiRingPreserving
!IsSkewSymmetric
!IsStrongInjective
!IsSymmetric
!IsWellFormedDoubleCodeUnitSequence
!IsWellFormedSingleCodeUnitSequence
!LIST_REWRITES
!MEMI
!OP
!Obsm
!Qe
!Quote
!REAL_REWRITES
!REL
!Subst
!U
!Y
!Y_ckt
!Zero
!\<^sub>0
!\<approx>
!^fmap
!^u
!^x_var
!a
!a0
!a1
!a2
!aP
!ab
!abs
!ac
!acc
!ad
!add1
!addr
!ai
!al
!alloc
!app
!aregn
!arg
!args
!ari
!arm
!arm1
!as
!asl1
!asm
!aut
!avoid
!ax
!b-sym-fold-to-stvi
!b-sym-foldi
!b-symi
!b\<rbrace>
!be
!bij
!bind_names
!bindings
!bitmaps
!bmap
!body
!bop
!buckets
!ce
!centre
!cenv
!check
!clauses
!co
!code
!comp
!complex_differentiation_theorems
!con
!con1
!cond
!cond1
!cond_f
!conf
!cont
!cos
!cosec
!cot
!count
!cset
!ctMap
!current-time
!cy
!data
!decls
!decls1
!decs
!defs
!dep
!dom
!domain
!done
!e
!e1
!e2
!e3
!eL
!el
!env
!env1
!env2
!envC
!eps
!epsilon
!eqs
!es
!ex
!exS
!execache
!exp
!expr
!exps
!extra
!fi
!flgi
!fmap
!fname
!forall
!forbidden
!forced
!form
!fp_op
!frag
!frag1
!funs
!ge
!gen_conf
!genv
!get_arr
!get_key
!ha
!heap
!high
!hyps
!i
!i1
!iB
!id
!ienv
!imm
!in
!in_itv/=
!ind
!index
!init
!input
!inst
!instB
!instL
!insts
!int_beg
!invariant_under_linear
!io
!ir
!ir1
!ireg
!is
!it
!iv1
!j!i
!junk
!key
!lab
!labl
!le
!len
!leq
!lets
!li
!limit
!lines
!list
!lo
!loc
!loc_opt
!locked
!loop
!low
!lowers
!marked
!max_app
!mem
!mem$ci
!mem-arrayi
!memi
!memi-!memi-same
!met
!mi
!min
!mode
!model
!modify
!moves
!mu
!name
!neg
!negate
!net
!new
!new_bytes
!num_edges
!o
!o1
!oal
!off
!ok
!old
!op
!op1
!opn
!opt
!oracle
!other
!params
!pat
!path
!path_extension
!pats
!penv
!pes
!phi
!phi0
!pi
!piE
!plaintext
!plist
!pos
!pre
!prev_args
!prog
!proj
!ra
!rec
!refs
!reg
!reg2
!registers
!regs
!res
!result
!ret
!rflags
!rflagsbits->af
!rflagsbits->af$inline
!rflagsbits->cf
!rflagsbits->cf$inline
!rflagsbits->of
!rflagsbits->of$inline
!rflagsbits->pf
!rflagsbits->pf$inline
!rflagsbits->sf
!rflagsbits->sf$inline
!rflagsbits->zf
!rflagsbits->zf$inline
!rgfi
!rho
!rip
!roots
!rows
!sa
!save_regs
!sec
!seen
!sem_f
!set
!si
!sig
!sigma
!sigma_b
!sin
!skip
!sob
!sol
!stack
!state
!step
!stvi
!sub
!subst
!ta
!tag
!tagL
!tan
!targs
!temp
!tenv
!tenv1
!tenvE
!tenvE1
!tenvS
!tenvT
!thePmatchCompileDB
!theta
!this
!ti
!time
!top
!top1
!tops
!tot
!tra
!trans
!transition
!tup
!ty
!ty1
!tyfrag
!tyop
!tys
!tys1
!u
!u0
!u1
!ul
!uniq
!upd
!uppers
!us
!used
!userKey
!uv
!uvns
!uvs
!var
!vars
!vlist
!vm1_neg
!vname
!word_POW2SIZE_CONV
!word_SIZE_CONV
!xI
!xenv
!xy
!y
!y0
!y1
!y2
!y4
!y86-of
!y86-of-less-than-expt-2-32
!y86-sf
!y86-sf-less-than-expt-2-32
!y86-zf
!y86-zf-less-than-expt-2-32
!ys
!Σ
!σ
#!ACL2
#!acl2
#!aignet
##\<^sub>L
#+acl2-devel
#+acl2-loop-only
#+joe
#+non-standard-analysis
#+skip
#>\<^bsub>G\<^esub>
#A
#A->A
#A->bool
#B-carrier
#Bags
#Class
#Closed_Domains_of
#Domains_of
#E
#Filt
#FreeSort
#Funcs
#I
#Ids
#NAT
#O
#O9
#OpenClosedSet
#Open_Domains_of
#REAL
#SEC
#U
#U32
#U64
#U8
#UV
#Vec
#\<^bsub>enat
#\<^bsub>n
#\<^bsub>n\<^esub>
#\<^sub>V
#\<^sub>\<Gamma>
#\<^sub>\<Gamma>G
#\<^sub>\<Gamma>\<Gamma>
#\<^sub>l
#\<alpha>#
#\<rho>
#\A
#\I
#\Space
#a
#a1
#a2
#aLen
#a_t
#absrep_id
#adaptation_note
#al
#arg_reg
#as
#bLen
#b_vec
#base
#blen
#bool
#carr
#carrier
#define
#e
#elif
#else\n
#endif\n
#eq
#es
#eval
#i
#if
#index
#inp_t
#int
#key
#leaves
#len
#len1
#len2
#mapCONG
#mapIMAGE
#mapO
#max_arity
#nLen
#nat
#nodes
#num
#occurrences
#pop-options
#pre
#proj
#push-options
#real^3
#rel
#repabs_pseudo_id
#reset-options
#set-options
#sᶜ
#term
#termP_term_REP
#term_ABS_pseudo11
#term_REP_11
#the
#the_sort_of
#ty
#u
#uint8
#updates
#value
#y
#ys
#|A
#|ACL2s-ToDo-Line|#
#|A|
#|E|
#|classes
#|coset
#|image
#|orbit
#α
#β
#ι
#κ
#σ
#ℬ
#𝒜
$1*^A
$1-BitBorrowOutput
$1-BitMajorityOutput
$1-tuples_on
$1<=len
$1=Partial_Sums
$1=U1
$1=i
$@addr
$A
$ARG
$ARG1
$Call
$Delete1
$E
$EXP
$F_AND
$F_OR
$GT_num_xnum
$GT_xnum_num
$IN
$INSERT
$INTER
$ISUB
$Inter1
$KA
$LEAST
$MOD
$NSUB1d
$NSUB1o
$OPEN
$POSTd
$POSTe
$POSTf
$POSTv
$SEP_EXISTS
$SUB1o
$SUB1t
$SUBSET
$SUB_xnum_xnum
$SUC
$Tyvar
$Tσs
$UNION
$\<^sub>e
$\<alpha>
$\<delta>
$\<mu>_
$\<mu>_x
$\<psi>
$\<sigma>
$\ell
$^apply
$a
$a^
$alts
$an
$arg
$arg1
$arg2
$args
$args*
$a⁻¹
$a₁
$a₂
$b_e
$backslash
$binder
$body
$bottom$
$bottom$-based-chain
$bottom$-based-chain-is-$<=$-chain-a
$bottom$-based-chain-is-$<=$-chain-f
$cert
$chain$
$contl
$contracts
$da
$diffl
$doc?
$dom
$e
$ea
$eab
$eb
$ed
$ek
$el
$em
$en
$ep
$eq
$er
$ex
$expands
$ey
$e₁
$e₂
$f$\<sigma>
$globals_approx_every_Fn_vs_NONE
$goal
$group
$ha
$hab
$has_type
$header
$hy
$i
$i$i
$i$j
$i$p
$i$swap
$iM
$i^
$ics
$id
$ih
$in1
$inst
$instα
$interleave
$j$i
$known_co
$labels_ok
$lit
$mc_conf_ok
$na
$name
$o
$op
$optAttr
$pa
$pat
$path
$pe
$pow
$proof
$pα
$sig
$some
$strlen
$syntax_ok
$syntax_oracle_ok
$sα
$term
$term2
$this
$time$
$tint_eq
$trat_mul
$ty
$type
$typeName
$u
$val
$y
$y₁
$y₂
$α
$β
$γ
$ε
$ι
$μ
$σs
$ⁿ
%%Function%%
%%f-formals
%%f-is-f
%%p-base
%%p-equalities
%%sub1-induction
%>^<%halt
%A
%A=A
%E
%GI
%I
%O
%Op1
%Spec
%Y
%a
%assert
%autoadmit
%autoprove
%ba
%bool
%buf
%cat
%char
%cheap_matches
%classic
%con
%coq_nat
%dhprop
%e
%eax
%endsnip\<close>
%f-formals
%fset
%functor
%i
%if
%in
%int_search
%invisible
%isomorphism
%itree
%list
%logic
%metricsH
%mode
%monad
%morphism
%mu
%nat
%nattrans
%natural_transformation
%object
%op0
%op1
%path
%pos
%positive
%pred
%rat
%rax
%rax\n
%rdi
%restrict
%rip
%rsi
%sep
%signature
%string
%tau
%type
%u
%u+
%u+h%w
%u+t%w
%v+s%u-x
%word
%y
%y+t%z
%ʷ
%ᵐᵒⁿᵒᵐⁱᵃˡ
%ᵒᶠ
%ₘ
&&-is-commutative
&0<=a
&0<A
&0<a
&0<a==>
&0<azim
&0<dist
&0<e
&0=A
&0=A/\
&0=a
&1*A=A
&1-A
&1-a
&1-ta
&1-u
&1=A
&1=a
&2*pi
&3*pi*
&A
&A_25519
&BOOL
&BadFileName_exn
&CARD
&FACT
&INT
&InvalidFD_exn
&LENGTH
&LIST_REL
&LIST_TYPE
&NUM
&NUMERAL
&Num
&OPTION_TYPE
&RATD
&RET_TYPE
&STRING_TYPE
&SUC
&SUM
&SessionType
&UNIT_TYPE
&UsageQuantifier
&^frac_tm
&__com1__run
&__com1__writer
&__futex_head
&__futex_lock
&__twa_array
&a
&ad
&app_basic
&binomial
&case
&ceiling
&declared
&dimword
&discovered
&e
&e_25519
&e_448
&flags
&fraction
&fromChars_unsafe
&g_cs_y
&g_semaphore
&hi
&i
&i/
&index
&it
&i’
&key
&ldquo
&len
&lo
&lock
&mdash
&mut
&mutex
&next_gen
&node
&nodes
&num_args
&num_from_dec_string
&op_index
&pay
&pow_seq
&prob_TYPE
&rem_args
&rest
&self
&something
&total_args
&u
&unwrap_TYPE
&y
&yp
&ν
&ₐ
&ₛ
*%E
**_e
**_e-lst
**list_Axiom**
**the
*-->a
*-1-commutativeMonoid
*-1-isCommutativeMonoid
*-1-isMonoid
*-1-monoid
*-1-rawMonoid
*-RECURSIVE
*-Rea
*-assoc
*-comm
*-commutativeSemigroup
*-complex
*-complex-lemma-1
*-complex-lemma-2
*-distrib-+
*-distribʳ-+
*-distribˡ-+
*-doubly-monotonic
*-doubly-strongly-monotonic
*-idem
*-identity
*-identityʳ
*-identityˡ
*-is-⊕-homomorphism-l
*-isMagma
*-isSemigroup
*-lists
*-magma
*-monomial
*-monomio
*-of-/-same
*-preserves->-for-nonnegatives-1
*-r-denominator-r
*-rawMagma
*-real-complex
*-semigroup
*-strongly-monotonic
*-strongly-monotonic-negative-multiplier
*-term
*-valued
*-weakly-monotonic
*-weakly-monotonic-negative-multiplier
*-zero
*-zeroʳ
*-zeroˡ
*0*<i>
*1_A
*2^x-byte-pseudo-page*
*64-bit-mod
*64-bit-mode*
*<e1>
*<e2>
*<e3>
*<i>
*<i>-t
*<i>/2
*>>rename
*A
*A=A
*A=A/
*ADR*
*Affin
*AffineMap
*Algebraic
*All
*Apply
*BN-254-GROUP-PRIME*
*Basic
*C=A*
*CASE
*COSTARRAYI*
*CREATE_NESTED_PT*
*Call
*Call*
*Case
*CastNode
*Catchall
*Cofactor
*DISJOINT
*Def
*Definition
*Demo-state*
*DigA
*DigB
*E
*E=
*EDGEARRAYI*
*EDGECOUNT*
*ERl
*EXS$-HI*
*EXS$-LO*
*EXS$-NEXT-BASE*
*EXS$-USE-SATLINK*
*FFI*
*FIXME
*Fib
*Finally
*First
*I
*INIT_PDPT*
*INIT_PDTS*
*INJ
*If*
*Im
*Im1
*Im2
*Im3
*IncProj
*Inst*
*Int
*Introduction
*Intros
*Keep
*Lege
*LongDiv*
*LongMul*
*Lucas
*MASKARRAYI*
*MAX_VERTICES*
*MEM-ARRAY-NEXT-ADDR*
*MEM-ARRAYI*
*MEM-TABLEI*
*Make
*Manual
*Met
*MetSp
*Move*
*NATIVE*
*NONE
*NOT*
*Next
*PATH_SUBSET
*PI
*Partial_Sums
*ProJ
*Product
*REG-det/ld_flag*
*REG/in_value*
*REG/ld_flag*
*RESULTARRAYI*
*Radix
*Re
*Rea
*Realizer
*Response
*Returning
*Ring
*SCM-OK
*SOURCEVERTEXARRAYI*
*Seq*
*Sets
*ShareInst*
*Some
*SuccNode1
*Sum
*THEN
*TODO
*Tail
*The
*This
*UNSIGNED*
*UPDATINGCOSTARRAYI*
*V*⅟A
*VERTEXARRAYI*
*WEIGHTARRAYI*
*Why
*\<^sub>#
*\<^sub>0
*\<^sub>1
*\<^sub>C
*\<^sub>Q
*\<^sub>R
*\<^sub>S
*\<^sub>V
*\<^sub>a
*\<^sub>m\<^sub>m
*\<^sub>p
*\<^sub>u
*\<^sub>v
*\<^sup>A
*^A
*^RED
*^denominator
*^exp
*_A
*_a
*_e
*_e-lst
*a
*a$arri*
*a$ptr*
*a$stki*
*a+
*a+d*b
*a0*
*a1
*a2
*a2+a1*
*abs
*abstract*
*addr-size*
*all-rec-names*
*alt-branch$select*
*alt-branch$select-buf*
*alt-merge$select*
*alt-merge$select-buf*
*arccos
*arccot
*arcsin
*arctan
*arity-alist*
*arri*
*a|^
*b-2*a*b*b
*b-vals*
*bad*
*badge-prim-falist*
*base-bvar$c*
*blocksize*
*bn-254-group-prime*
*buy
*by
*bytes-per-word*
*c*d=a*b*d*c
*c=a
*cancell
*card
*check_menv
*chosen
*cipher-1*
*class-headsi*
*class-nextsi*
*comp-interl$interl2*
*comp-interl$l0*
*comp-interl$l1*
*compatibility-mode*
*compose
*concrete-snpt-binary*
*copyData*
*cos
*cosec
*cosh
*cosh_C/
*cot
*coth
*current-dir-fat32-name*
*cut-infoi1*
*cut-leavesi1*
*data-regioni*
*dbar
*debugdata->nextstates*
*default*
*deleted-clause*
*delta
*denominator
*diff
*digit-chars*
*dist
*div-funct7*
*e
*e*a
*eba$c->bitsi*
*eba$c->wordlisti*
*eio*
*elab-mod$c->modinstname-idxes-get*
*elab-mod$c->modinsttablei*
*elab-mod$c->ninsts*
*elab-mod$c->nwires*
*elab-mod$c->wirename-idxes-get*
*elab-mod$c->wiretablei*
*elab-modinst$c->instname*
*empty-clause*
*empty-clause*-lemma
*enoent*
*enospc*
*enotdir*
*eof*
*epsilon
*ex
*exp
*exp_R
*f*reproj
*fact*
*fact-def*
*factorial_recursive*
*fati*
*fib-symbol-table*
*file-types*
*findmin
*fixnat-bits*
*fixnum-bits*
*flags*
*fld1i*
*float-nan*
*float-negative-infinity*
*float-negative-zero*
*float-positive-infinity*
*float-positive-zero*
*fmt-globals*
*for
*free
*g*Perm
*generic-tame-badge-1*
*goal
*goldInHouse
*graph
*h*reproj
*hom
*i
*i2
*ia32_efer-idx*
*id
*if
*ifact-program*
*igcd$interl*
*igcd$l*
*in1
*in2
*initial-global-table*
*initial-globals*
*initial-vars*
*initialbytcnt*
*input
*insi*
*integrable
*integral
*inv
*ip
*is-constraint-db*
*is-obligs*
*iter
*key-1*
*lambda
*link$d*
*link$s*
*link1$d*
*link1$s*
*list_case_lemma
*log
*lookup*
*lower*
*lui-opcode*
*m-size*
*m1-boyer-moore-program*
*m86-32-segment-reg-names-len*
*makespan
*max
*max-1d-array-index*
*max-1d-array-length*
*max-def*
*max-fanin*
*max-hash-bytes*
*max-key-bytes*
*max-linear-address-size*
*max-type-set*
*mem$ci*
*mem-array-next-addr*
*mem-arrayi*
*mem-size-in-bytes*
*mem-table-size*
*mem-tablei*
*memi*
*min
*min-type-set*
*minus-1*
*mod-prog*
*moddb->modname-idxes-get*
*moddb->modsi*
*moddb->nmods*
*modetrans
*mr-eax*
*mr-esp*
*ms-bad-cluster*
*ms-d-e-length*
*ms-first-data-cluster*
*ms-max-dir-size*
*ms-min-bytes-per-sector*
*multiply-opcode*
*nand-delay*
*native*
*netlist1*
*newline*
*next-bvar$c*
*nil*
*no-access*
*nodecut-indicesi1*
*nodesi*
*non-nil*
*non-trivial
*norm
*not*
*null*
*num-fanins*
*num-ins*
*num-level-entries*
*num-mem-words*
*num-of-buffers*
*num-outs*
*num-page-words*
*num-pages*
*num-polytopes
*num-regs*
*num-vars*
*numerator
*opcode-size*
*outsi*
*parent-dir-fat32-name*
*passengerFlow
*pathcond-aig*
*pathcond-aignet*
*pathcond-bdd*
*pathcond-enabledp*
*pi
*pi*
*pi/
*prime*
*primitives*
*proj
*proof
*pseudo-page-size-in-bytes*
*rax*
*rdi*
*read-only*
*read-write*
*regsi*
*reproj
*rgfi*
*rob-size*
*round-robin2$me*
*round-robin2$q4-l*
*round-robin2$q5-l*
*round-robin3$me*
*round-robin3$q10-l*
*round-robin3$q8-l*
*round-robin4$q40-l0*
*round-robin4$q40-l1*
*rsi*
*sbitset-block-size*
*scratchobj-types*
*sec
*second
*second-method*
*seq
*seq1
*seq3
*sin
*sinh
*sinh_C/
*sm-count*
*sm-indicesi*
*sm-range*
*small-bits*
*small-nat-bits*
*smme-blockstartsi*
*smme-memi*
*space*
*sq-def*
*st-foo-bad*
*st-fooi*
*stack$c-frame-next-scratchi1*
*stack$c-frame-top-minori1*
*stack*
*stack-end*
*stateman-arities*
*sum
*svex-op-table*
*tab*
*tan
*tanh
*test
*the
*the_arity_of
*this
*too
*trigger*-unique-subbagps-implies-disjointness
*u
*u1
*universal-program*
*vol
*width+w
*width+width
*word-size*
*x+a
*x86-field-names-as-keywords*
*x86-page-directory-entry*
*xdi-sm-fork*
*xdi-sm-join*
*xdi-sm-merge*
*xdi-sm-storage*
*y
*y+
*y1
*y2
*y3
*y4
*y^2
*|sin
*ᵖ
*ᵣ
*ᵥ
*ₗ
*ℂ
*ℕ
*ℚ
*ℚˣ
*ℚ⁺
*ℝ
*ℝ⁺
*ℤ
+%E
+%dE
+*1GateCircStr
+*I
+*id
+*the
++-assoc
++-identityʳ
++-identityˡ
++ARITH_ss
++BAG_ss
++DROP
++ETA_ss
++Fin
++LET_ss
++MAP
++QUANT_INST_ss
++\<^bsub>S\<^esub>
++\<^sub>f
++_e
++bitstringLib
++boolSimps
++env
++env2
++envs
++et
++join_env
++numSimps
++refs
++resq_SS
++ret_rest++h_rest
++stuff
++wordsLib
++ys
++⁺ˡ
+-*-rawNearSemiring
+-*-rawRing
+-*-rawSemiring
+-0-commutativeMonoid
+-0-isCommutativeMonoid
+-0-isMonoid
+-0-monoid
+-0-on-right
+-0-rawGroup
+-0-rawMonoid
+-ClosenessSpace
+-IS-SUM
+-RECURSIVE
+-assoc
+-clofun
+-comm
+-commutativeSemigroup
+-cong
+-identity
+-identityʳ
+-identityˡ
+-is-SUM
+-is-discrete
+-is-prop
+-is-sum
+-isMagma
+-isSemigroup
+-lists
+-magma
+-mono-<-≤
+-mono-≤
+-mono-≤-<
+-monomial
+-monomio
+-monoʳ-<
+-monoʳ-≤
+-monoˡ-<
+-monoˡ-≤
+-of-logcons-with-cin
+-rawMagma
+-semigroup
+-sin
+-suc
+-zero
+1/exp_R
+16*a3|^2
+16*a3|^2*a2
+1<=len
+2*Im
+2*sinh
+3-root
+=\<^sub>m
+A
+A=
+A=A
+Assoc
+B=B-A
+Bin
+Binℕ
+Col
+Comm
+DigA
+Dof
+E-bound
+Fib
+GenFib
+IdR
+Im
+Im1
+Im2
+Integral
+LENGTH
+Line
+Lucas
+Mo
+Partial_Sums
+Re
+Rea
+SUC
+Sum
+\<^sub>1
+\<^sub>L
+\<^sub>N
+\<^sub>\<omega>
+\<^sub>p
+^dom
+_A
+_a
+_a-Compatibility-of-<=_a
+_e
+a
+a*
+a/
+a1
+a1*
+a1*a2
+a2
+a2*
+a2+b2
+a3*x^2+a4*x+a5
+abs
+allowSynthFailures
+angle
+arith
+a|^
+card
+contextual
+contextual⟩
+cos
+cosh
+cot
+decide
+diff
+disjoint
+dist
+distance
+distrib
+duration
+e
+exp
+exp_R
+f2*reproj
+fLastLeg
+frac
+functor
+hap
+i
+id
+infty
+instances
+integral
+len
+lim
+ln/cos^2
+max-
+mod
+n-vec
+nRadius
+negsuc
+negsucc
+no
+nondep
+num_tuples1
+num_tuples2
+num_tuples3
+o
+o_
+oo%E
+oo%O
+oo%R
+op
+partdiff
+pdiff1
+pos
+revert
+seq1
+seq_id
+serviceTime
+sin
+singlePass
+sinh
+splitIndPred
+tMaxBetwRecl
+tan
+tanh
+u
+unfoldPartialApp
+y
+y*sqrt
+y|^
+zetaDelta
+ᵒ
+ᵣ
+ᵥ
+ᵥ>
+ₒ
+ₒ-↓-left
+ₒ_
+ₕ
+ₖ
+ₘ
+ℂ
+ℕ
+ℚ
+ℚ_
+ℚ⁺
+ℝ
+ℤ
+ℤ_
+𝕀
-$a
-%E
-&LENGTH
-&SUC
-&y
-->FALSE
-->TRUE
-->a
-->a9
-->e
-->union
-->val
-->y
-->y2
-->ₐ
-->ₛ
--A/\
--Im
--Im1
--Im2
--Im3
--Re
--TODO
--a<
--a=
--abs
--admit_smt_queries
--basis
--becomes-*-of--1
--bracket
--ca
--cc_eps
--cexp
--clog
--compile
--cos
--debug
--delta_x4
--drop
--e1<t
--e2
--e3
--e4
--e<
--e<t
--fuel
--ifuel
--ii
--inv
--lift
--log
--mat
--max_fuel
--mbasis
--norm
--peropp
--pi
--real_integral
--retry
--section
--sin
--sum
--vec
--vsum
--z3cliopt
--z3rlimit
-1*cos
-1*sin
-1+Fexp
-1-1-onto->
-1/2*<i>
-1/a
-1/cos
-1/exp_R
-1/sin
-1<=i
-1<=ind
-1_F_Complex
-1i
-2*PI
-2*PI*n
-2*a*b
-2*n*PI
-2*sin
-2*y
-2-Category
-2-root
-2^prec
-3*a3
-3*a3|^4
-4*a*c
-4*a2*a3
-64*a3*a1
-<e1>
-<e2>
-<e3>
-<i>
-<i>*
-<i>*x
-<i>*z
-<i>*z1
-<i>*z2
-=\<^sub>m
->A
->A#B+A#C
->A#real
->A->A->bool
->A->bool
->A->real
->B->A
->Element
->Function
->LABEL_TAC
->MP_TAC
->P->A
->P->bool
->REWRITE_TAC
->Real
->below
->bool
->complex
->exists
->forall
->i
->in_part
->int
->non
->num
->num->A
->num->num
->num->real
->num->real^N->bool
->o
->real
->real^
->real^1
->real^2->bool
->real^3
->real^3->bool
->real^M
->real^M->bool
->real^N
->real^N->bool
->real^N->real
->real^N->real^N->bool
->real^P
->set
-?derive1E//
-@u
-A
-A=
-AlgEquiv
-Arg
-B/A
-B=A
-BinaryBiconeMorphism
-BinarySequence
-BitAdderStr
-BitGFA0Str
-BitGFA1Str
-BitSubtracterStr
-C=A+B-C
-CEdge
-COMPLEX2Field
-C_ESWs
-Cancel
-Complex
-ContinuousLinearMap
-DEF
-Dbot
-Double
-E
-E-max
-EFinD
-EX
-FanMorphE
-FanMorphN
-FanMorphS
-FanMorphW
-Fin
-Finset
-Function
-Functor
-G\<rightarrow>
-G\<rightarrow>\<^sup>*
-H_eq
-Hall
-I
-IEdge
-IH
-IS-UNIQUE
-Ideal
-Im
-Im1
-Im2
-Im3
-Index
-Int
-InterpretersOf
-Iso
-LLPO
-LSeries
-LeftIdeal
-LinearEquiv
-LinearMap
-Lipschitz
-Matrix
-Module
-Nat
-Normal
-OF-
-OF-CONS
-ObjectProperty
-Orte
-Ortm
-PI
-PI/2
-PI/2+2*PI*i
-PI/2+T
-PI/4
-Partial_Sums
-ProJ
-RATN
-REDEF
-R_EAL
-Radix
-Re
-Rea
-Real
-RightIdeal
-Root
-Rotate
-Scheme
-Seg
-Set
-SetLike
-Sub_VERUM
-Subtrees
-Subtype
-Sum
-Sylow
-SymbolSubstIn
-TYPE
-Tensor
-TermEval
-TruthEval
-U
-Units
-Veblen
-VectSp_over
-WHEN-
-WHILE
-Y
-\<^sub>o\<^sub>w
-\<^sub>p
-\<^sub>s
-\<^sub>v
-\<i>
-\<infinity>
-_A
-_a
-_e
-a
-a*
-a*t2
-a*x
-a+a
-a+sqrt
-a1
-a1*a2
-a1/
-a2
-a2*x1
-a3
-a3*x1
-a3/4
-a4
-abelem
-abs
-absent
-action
-adic
-admissible
-algebra
-algebras
-alt
-and-
-app_nil_end
-arccot
-arccot-id
-arcsin
-arctan
-are-singletons
-are_equivalent
-are_prob_equivalent
-arrival
-aryF
-as
-as@a#as
-as\<rightarrow>*
-as\<rightarrow>\<^sub>\<surd>*
-as\<rightarrow>\<^sub>d*
-assoc
-associated_apply
-autonomic
-aux
-ax^2/4
-a’
-a⁻¹
-a₂
-a₃
-b/a
-bag
-balancing
-boundary
-bounding-chain-space
-c*a
-c-n\<rightarrow>
-c\<rightarrow>
-card
-carrier_of
-cdif
-chain-space
-cheap
-check
-circuit-space
-coeff
-coincide
-colorable
-comm
-compatible
-conj
-continuous
-convergent
-correct
-cos
-cos*sin
-cos-
-cosec
-cosec*exp_R
-cosec*ln
-cosec*sin
-cosec*tan
-cosec-id
-cosh
-cot
-cot*exp_R
-cot*ln
-cot*tan
-cot+cosec
-cot-cosec
-cot-id
-coth
-cov
-cseq
-cut
-decr
-defined
-delta
-deriv
-derivWithin
-derivable
-derivables
-derive1E
-diff
-diff-
-dtuple
-e
-e/2
-element
-elt
-entry_points_in_subformula_tree_of
-eps
-eq_states_EqR
-eq_states_partition
-equiv-↓
-equiv-𝓘nd
-et
-et\<rightarrow>
-et\<rightarrow>\<^sub>p
-eta_q
-euc2cpx
-eval
-eventually_and
-ews
-exp
-exp2
-exp_R
-exp_R*arccot
-exp_R*cosec
-exp_R*cot
-ext
-extends-f
-extends-p
-extension_of_the_topology_of
-f2*reproj
-fdif
-final-locals
-finds-counterexample
-fker
-floor
-fmap
-forest_components
-frac
-free
-freeInterpreter
-from-square
-functor
-gO
-gen
-gives-discrete
-greatest
-group
-halted
-hash
-how
-hyps
-i
-i2
-i^i
-id
-ideal_load_ceil
-idempotent
-if
-ih2
-im
-in
-ind
-indexNeg_neg
-indexed
-indexing
-indexing_of
-inf
-infinity
-infty
-injective
-inner
-instance
-int
-integrable
-integral
-interpreter-like
-inv
-inverse
-is-associative
-is-commutative
-is-decidable
-is-finite
-is-prop
-is-prop-valued
-is-reflexive
-is-set
-is-transitive
-is-δ-net
-jvm\<rightarrow>
-jvm\<rightarrow>\<^sub>1
-ker
-largest
-leads_to
-least
-left-monotone
-lemma
-len
-level
-lex
-lim
-linear
-lipschitz_on
-list
-ln*cosec
-ln/sin^2
-load_of
-log
-loop-final-locals
-lower₂
-map
-map_Cons
-map_mul
-max-
-measurable
-min
-module
-modules
-mu
-mu1
-mu2
-mulLeftRight
-mul_eq_zero
-mutable_x
-nRadius
-nat
-necc
-neg_add_rev
-negative_set
-negligible
-neighborhood
-neighbour
-norm
-normSq
-normal
-not_and
-null_set
-numerator
-o
-of-
-of-0
-of-bvchop-arg2
-of-bvchop-arg4
-of-cons
-of-nil
-of_real
-one
-one_div
-onto->
-oo%E
-oo%O
-oo%R
-op
-order
-out
-padicValRat
-part-of-decomposition
-partdiff
-payload
-pdiff1
-periodic
-pi
-pi/2
-placesOf
-polytopes
-pos
-pow2
-power
-prec
-pred
-prefix
-preserving
-primitive_root
-proofs
-provable
-real
-real-root
-rec
-reduce
-refl
-relation
-removal
-representation
-respecting
-response
-return-type
-return-type-2
-return-type-corollary
-return-type-corollary-linear
-return-type-linear
-rewrite
-right-neutral
-ring
-root
-row
-same
-same-
-sec*
-sec*cos
-sec*cot
-seq
-seq-in
-seq1
-seq2
-seq2-
-seq3
-seq_id
-series
-sigma
-sigmaLower
-sign
-simp
-sin
-sin*cos
-sin+
-sin_C/
-sine
-single
-sinh
-small
-smooth
-smul_eq_mul
-spec
-specific
-sphere
-strong
-style
-subgroup
-succ
-succ_of
-sum
-support
-support-yielding
-sym
-syntax
-tan
-tan*
-tan*cot
-tanh
-tau_bar
-term
-termEq
-termal
-to-
-to-T
-to-normalise-pos
-to-ℕ→𝟚
-to-▹*
-top
-trans
-tree
-tuple
-tuples_on
-two
-two_p
-u
-unique
-unity_root
-unless-equal
-upper
-upper_bound
-upper₁
-us
-v+A
-v\<^sup>T
-val_fin_le
-valued
-weaken
-when-
-when-atom
-when-not-consp
-x*y
-x+y|
-x\<^sup>2
-y
-y*
-y*y
-y*z
-y0
-y1
-y2
-y|^
-y’
-y⟩
-Π
-α
-β->
-β->*
-γ
-ε
-ζ
-η
-η->
-η->*
-θ
-μ
-ν
-π
-πᵃᵇ
-φ
-ψ
-ω
-ᴹ
-ᵥ
-ₕ
-ₕ^
-ₖ
-ₘ
-ℕ→𝟚
-ℚ
-ℝ
-ℤ
-↑a
/*seq
/*seq=h1/*seq+h2/*seq
/-cancellation-on-left
/-cancellation-on-right
/-induction
/-induction₂
/-inverts-order-1
/-is-set
/-strongly-monotonic
/-weakly-monotonic
//Since
//This
//assert
//compiler
//eliminating
//embed
//en
//github
//leanprover
//let
//math
//mathoverflow
//mk_unadorned_v39
//ncatlab
//rather
//saltLen
//stacks
//unembed
//val
//with
//ysharifi
/2*cosh_C/
/2*sinh_C/
/2<abs
/9+log
/A
/D+e*
/FldExt
/I
/\-IRR
/\-SemiLattStr
/\-complete
/\-distributive
/\-inheriting
/\/FI
/\0+a=a/\a<=a
/\<^sub>L
/\<^sub>R
/\DOMS
/\a
/\dom
/\halfline
/\left_open_halfline
/\packing
/\right_open_halfline
/^i
/_A
/_a
/a
/a+
/a-1+
/a1
/abs
/andP
/and_tl
/arithmetic/top
/cos
/cosh
/denominator
/e
/event_step_star
/exp_R
/extensional
/id
/ker
/log
/net_handlers
/norm
/occurred
/p-identity-right
/pi
/predU1P
/pt_map_name_msg
/pt_map_net
/pt_map_onet
/pt_mapped_net_handlers
/r-when-abs-numerator=1
/reg
/serialize_net
/sin
/sinh
/step_async_init
/step_ordered_failure_init
/step_star_lb_step_reachable
/su
/support/logior
/tan
/tot_map_name
/tot_map_net
/tot_map_packet
/tot_map_trace_occ
/u
/u*v
/unlabeled_net_handlers
/update
/y
/ʷ
/ᵐᵒⁿᵒᵐⁱᵃˡ
/ᵒᶠ
/ₒ
/ₘ
/ₚ
/ₜ
/ℕ
/ℚ
0%E
0%nat
0**A
0*<i>
0*i
0+0*<i>
0+1<=len
0+2*PI
0+2*PI*n
0+2*n*PI
0+A=A
0+Im
0+a=a
0+i
0+i=i
0+x*<i>
0-A=
0-BitAdderStr
0-BitSubtracterStr
0-ary
0-based
0-cell-Globular-Type
0-convergent
0-cos
0-element
0-element_of
0-i
0-im
0-polytopes
0-preserving
0-ranked
0-sin
0-started
0-termal
0-tuples_on
0/abs
0123456789ABCDEF
01_Lattice
0<=a
0<=a<=>
0<=abs
0<=i
0<=i/\
0<=i<=30
0<>denominator
0<SUC
0<a
0<a<=>
0<a==>
0<abs
0<denominator
0<e
0<exp_R
0<i
0<i==>
0<len
0<lim
0<seq
0<y
0<δ
0<ε
0=1ℂ
0==fExistLeg
0==fLastLeg
0=A
0=CARD
0=a
0=i1
0>a
0>a1
0>a2
0>a3
0A
0Functional
0RFunctional
0\<^bold>
0\<^sub>L
0\<^sub>g
0\<^sub>h
0\<^sub>m
0\<^sub>o\<^sub>w
0\<^sub>p
0\<^sub>v
0\<close>
0\<dots>
0\<le>
0\<le>x
0\<rangle>
0\<rbrace>
0\<rbrakk>
0\<rceil>
0_Lattice
0_Rmatrix
0_e
0a
0e
0hop
0i
0kikj
0ul
0uy
0x00uy
0x01uy
0x02uy
0x03uy
0x04uy
0x05uy
0x06uy
0x07uy
0x08uy
0x09uy
0x0a
0x0auy
0x0buy
0x0cuy
0x0duy
0x0euy
0x0fuy
0x10uy
0x11uy
0x12uy
0x13uy
0x14uy
0x15uy
0x16uy
0x17uy
0x19uy
0x1auy
0x1buy
0x1cuy
0x1duy
0x1fuy
0x20uy
0x21uy
0x24uy
0x26uy
0x27uy
0x28uy
0x29uy
0x2Ew
0x2auy
0x2buy
0x2cuy
0x2euy
0x2fuy
0x30uy
0x31uy
0x32uy
0x33uy
0x34uy
0x36uy
0x37uy
0x39uy
0x3Ew
0x3auy
0x3buy
0x3cuy
0x3duy
0x3e
0x3fuy
0x40uy
0x41uy
0x42uy
0x44uy
0x45uy
0x46uy
0x47uy
0x48uy
0x49uy
0x4a
0x4auy
0x4duy
0x4euy
0x4fuy
0x50uy
0x51uy
0x52uy
0x53uy
0x54uy
0x55uy
0x57uy
0x58uy
0x59uy
0x5A
0x5auy
0x5buy
0x5cuy
0x5duy
0x5euy
0x5fuy
0x61uy
0x62uy
0x63uy
0x64uy
0x65uy
0x66uy
0x67uy
0x68uy
0x69uy
0x6Aw
0x6Cuy
0x6auy
0x6buy
0x6cuy
0x6duy
0x6e
0x6euy
0x6fuy
0x70uy
0x71uy
0x72uy
0x73uy
0x74uy
0x75uy
0x76uy
0x77uy
0x78uy
0x79uy
0x7auy
0x7buy
0x7duy
0x7euy
0x7fuy
0x80uy
0x81uy
0x82uy
0x84uy
0x85uy
0x86uy
0x87uy
0x88uy
0x89uy
0x8Ew
0x8auy
0x8buy
0x8cuy
0x8euy
0x8fuy
0x90uy
0x91uy
0x92uy
0x93uy
0x94uy
0x98uy
0x99uy
0x9buy
0x9cuy
0x9duy
0x9euy
0x9fuy
0xA4w
0xA7w
0xAw
0xBAw
0xCAw
0xE0w
0xE2w
0xE4w
0xE8w
0xE9w
0xEBw
0xECw
0xEFw
0xEw
0xFEw
0xa
0xa2uy
0xa3
0xa3uy
0xa4
0xa4uy
0xa5uy
0xa6uy
0xa7
0xa8uy
0xa9
0xa9uy
0xaauy
0xabuy
0xacuy
0xad
0xaduy
0xaeuy
0xafuy
0xb0uy
0xb1uy
0xb2uy
0xb3uy
0xb4uy
0xb6uy
0xb7uy
0xb8uy
0xb9uy
0xba
0xbauy
0xbbuy
0xbcuy
0xbduy
0xbeuy
0xbfuy
0xc0uy
0xc1uy
0xc2uy
0xc3uy
0xc4uy
0xc5uy
0xc6uy
0xc7uy
0xc8uy
0xc9uy
0xcauy
0xcbuy
0xccuy
0xcduy
0xceuy
0xcfuy
0xd2uy
0xd4uy
0xd5uy
0xd6uy
0xd7uy
0xd8uy
0xd9uy
0xdauy
0xdbuy
0xdcuy
0xdduy
0xdeuy
0xdfuy
0xe
0xe1
0xe1uy
0xe2uy
0xe4
0xe4uy
0xe5
0xe5uy
0xe6uy
0xe7uy
0xe8
0xe9uy
0xeauy
0xebuy
0xecuy
0xeduy
0xeeuy
0xefuy
0xf0uy
0xf1uy
0xf2uy
0xf3uy
0xf4uy
0xf5uy
0xf6uy
0xf7uy
0xf8uy
0xf9uy
0xfauy
0xfbuy
0xfcuy
0xfduy
0xfeuy
0xffuy
0ᴹ
0ᵇ
0ₕ
0ₕ∙
0ₖ
0ℓ
0ℙ
0ℚ
0ℚᵘ
0ℝ
0ℤ
1%>^<%halt
1%functor
1%nat
1%positive
1*3+i/\
1*4+i
1*4+i/\
1*5+i/\
1*<e1>
1*A=A
1*^exp
1*a
1*abs
1*cos
1*denominator
1*k+i=i+k
1*k+y=k+y
1*sin
1*u
1*x+-a
1*x+-a=1*x-a
1*x+a
1*y
1+1-1<=len
1+1<=len
1+<i>
1+A
1+A<=4<=>
1+LENGTH
1+Partial_Sums
1+^omega
1+a
1+a^2
1+arity
1+cos
1+divsize
1+e
1+exp_R
1+height
1+i
1+i=SUC
1+i=i+1
1+len
1+log
1+restseq
1+sin
1+size
1+tanh
1+x*y
1+y
1+y^2
1--i
1->A
1->num
1->real
1-Alg
1-Type
1-Veblen
1-\<theta>
1-a
1-a1
1-ary
1-at_most_dimensional
1-a|^n
1-bit
1-bits
1-cell-globular-structure
1-cell-globular-type-Globular-Type
1-cos
1-divides-all
1-eb
1-element
1-element_of
1-factor
1-form
1-i
1-lambda
1-lipschitz_on
1-morphisms
1-prec
1-ranked
1-sin
1-sorted
1-sorted-yielding
1-stNotUsed
1-stRWNotIn
1-tan
1-tanh
1-tree
1-tuples_on
1-u
1-x*y
1-y
1/A
1/a
1/a+1/b
1/a+1/b+1/c
1/a1
1/cos
1/cosh
1/diff
1/frac
1/i
1/log
1/number_e
1/of_nat
1/sin
10-eta
10=x10&a1
10ul
10|^i
11_in
12_in
12_on
12ul
13_in
14ul
15ul
16%nat
16*a
16*i
16-bit
16-element
16bit
16ul
18ul
192ul
1<=Index
1<=a
1<=a<=>
1<=e
1<=i
1<=i+1
1<=i/\
1<=i0
1<=i1
1<=i1-
1<=i2
1<=len
1<=p-2+i
1<=width
1<=y
1<CARD
1<a
1<dimindex
1<e
1<i
1<i1
1<i2
1<len
1<width
1==fLastLeg
1==sum
1=Re
1=SUC
1=W-min
1=a
1=arity
1=e
1=i
1=len
1=x1&a1
1=y
1>=a
1>a
1>e
1Cat
1GateCircStr
1GateCircuit
1PCat
1TopSp
1\<^sub>C
1\<^sub>L
1\<^sub>\<inter>\<^sub>\<inter>
1\<^sub>\<nat>
1\<^sub>\<nat>\<rparr>\<^sub>\<bullet>
1\<^sub>\<pi>
1\<^sub>\<sigma>
1\<^sub>\<union>\<^sub>\<union>
1\<^sub>h
1\<^sub>m
1\<^sup>A
1\<^sup>\<circ>
1\<bar>
1\<close>
1\<rangle>
1\<rbrakk>
1_A
1_F_Complex
1_F_Real
1_I
1_Lattice
1_Rmatrix
1_a
1_atom
1_e
1_minus
1_on
1_product
1_root_of_cubic
1_root_of_quartic
1a
1bag
1e
1i
1mBack
1o
1prime
1r-a
1st-comp
1st-complete
1st-complete-correctness-1
1st-complete-under-path
1ul
1Π
1π
1ᵇ
1‖ₑ
1ℙ
1ℚ
1ℚᵘ
1ℝ
1ℤ
2!case
2!tot_map_name_inv_inverse
2!ulp_neq_0
2%nat
2%positive
2*<e2>
2*<i>
2*Fib
2*GenFib
2*Ix
2*LENGTH
2*Lucas
2*PI
2*PI*
2*PI*$1
2*PI*0
2*PI*1
2*PI*i
2*PI*i+
2*PI*i+0
2*PI*i+r
2*PI*j
2*PI*k
2*PI*k+0
2*PI*n
2*PI*r
2*PI*r*$1
2*PI*r*x
2*PI*x
2*PI+2*PI*i
2*PI+T
2*PI-r
2*PProJ
2*Re
2*SUC
2*Sum
2*\<delta>
2*\<delta>+1
2*\<epsilon>*ln
2*\<i>*pi*
2*\<i>*pi*complex_of_nat
2*\<i>*pi*j/
2*\<rho>*
2*a
2*a*b
2*a+1
2*a2
2*a2|^3
2*a^2*sqrt
2*angle
2*card
2*cos
2*cosh
2*cum_tuples1
2*cum_tuples2
2*exp
2*i
2*i+1
2*k+len
2*len
2*n*PI
2*n+i
2*number_e
2*pi
2*prec
2*realpart
2*sec
2*sin
2*sinh
2*sinh_C/
2*size
2*tan
2*tanh
2*u
2*u+1
2*x*y
2*y
2+-listp
2+2ᶜ
2+i
2-Element-Type
2-Poset
2-ary
2-by-2
2-complement
2-dimensional
2-morphisms
2-ndRWNotIn
2-ord
2-ranked
2-root
2-sorted
2-to-the-n
2-to-x
2-tree
2-tuples_on
20the
20ul
21_in
21bi
22_in
23_in
24ul
256%nat
256*a0
256-bit
256ul
25ul
26ul
27*a0
28ul
2<=a
2<=a==>
2<=i
2<=len
2<i2
2<len
2=Im
2=den
2=x2&a1
2=y
2>=nBoxType
2Correct
2D-mesh-NodeSetp
2D-mesh-nodesetp
2DLevelPacking
2DMesh-NodeSetp
2DMesh-Nodep
2DPacking
2GatesCircOutput
2GatesCircStr
2GatesCircuit
2Ideal
2LIST
2SET
2Set
2TEE-1
2VEC
2\<^sub>\<nat>
2\<le>b
2\<rangle>
2\<rfloor>
2\<times>x
2^LENGTH
2^Y
2^eb
2^emax
2^i
2^log_n_steps
2^prec
2^width
2_on
2_root_of_cubic
2_root_of_quartic
2a
2d-array-height
2d-array-width
2d-arrayp
2d-bv-arrayp
2d-mesh-nodesetp
2darr
2darr->ncols
2darr->rows
2darr-index
2darr-index-inverse
2i
2isBoolean
2list
2n<i
2o
2pi
2pi/a
2pre_rmap
2prime
2sComplement
2set
2ul
2vec
2vec->val
2vec-of-4vec->lower
2vec-p
2vec-subtract
2vecx-p
2w*i
2|^i
3!case
3*<e3>
3*Fib
3*Re
3*a
3*a*c-b^2
3*a*d-b*c
3*a1
3*a^2
3*contestant
3*cos
3*cum_tuples2
3*cum_tuples3
3*sin
3*v*u+p
3*y
3*y^2
3+4*cos
3+i
3-4*cos
3-ary
3-by-3
3-lemma
3-lemma-a
3-rdRWNotIn
3-root
3-tree
3-tuples_on
3/2*PI
3/2*PI+2*PI*i
3/2*PI+T
3/4*PI
302a4aba78412ab36940f4be7b940a0c728542b8b81d95b801a57b3797f9dd6e
30ul
31_in
32-bit
32-bit-segment-size
32-bit-segment-start
32-bit-segment-start-and-size
32-tuples_on
32_in
32bit
32bit-listp
32ul
33_in
33ul
3<6/\a<=a/\
3=x3&a1
3VEC
3VEC-?
3VEC-?*
3VEC-BITOR
3VEC-FIX
3\<^sub>\<nat>
3\<rangle>
3\<times>x
3_3-e
3_dot
3_root_of_cubic
3_root_of_quartic
3a
3eqtr4i
3mformula
3mname
3o
3prime
3ul
3v-fix
3valued-syntaxp
3vec
3vec-==
3vec-?
3vec-?*
3vec-bit?
3vec-bitnot
3vec-bitor
3vec-fix
3vec-p
3vec-p!
3vec-reduction-and
3vec-reduction-or
4%nat
4*LENGTH
4*OBJECTIVE
4*a
4*a^2
4*i
4+a|^
4-cube
4-tree
4-tuples_on
4096-bit
40ul
43i
47mDO
47mappend
47mencapsulate
47mfoo
47mloop$
47mmember
47mnil
48-tuples_on
48ul
4<=6/\a<=a/\
4VEC
4VEC->LOWER
4VEC->UPPER
4VEC->lower
4VEC-BIT?
4VEC-BIT?!
4VEC-BITAND
4VEC-BITOR
4VEC-BITXOR
4VEC-CONCAT
4VEC-CONCAT$
4VEC-FIX
4VEC-MASK
4VEC-P
4VEC-PART-SELECT
4VEC-RSH
4VEC-SHIFT-CORE
4VEC-ZERO-EXT
4_root_of_quartic
4o
4ul
4v->faig-const
4v-al-to-sexpr-al
4v-alist-<=
4v-alist-<=-hons-assoc-equal-example
4v-alist-<=-witnessing
4v-alist-boolp
4v-alist-equiv-faig-const-alist->4v-alist-lemma
4v-alist-extract
4v-alist-for-bitspec-entryp
4v-alist-for-bitspecp
4v-alist-to-param
4v-alist-to-params
4v-alistp
4v-alists-agree
4v-alists-agree-to-4v-env-equiv
4v-alists-agree-witnessing
4v-and
4v-and-list
4v-bitspec-entry-vars
4v-bitspec-entryp
4v-bitspec-param-len
4v-bitspec-vars
4v-bitspecp
4v-bool-alist-fix
4v-bool-listp
4v-boolp
4v-env
4v-env-equiv
4v-env-equiv-to-key-and-env-equiv
4v-env-equiv-witnessing
4v-fix
4v-from-bool-list
4v-ite
4v-ite*
4v-key-bool-alistp
4v-list-<=
4v-list->faig-const-list
4v-list-fix
4v-listp
4v-lookup
4v-lookup-default
4v-lookup-list
4v-not
4v-nsexpr-alist-p
4v-nsexpr-list-p
4v-nsexpr-vars-sparse
4v-onehot-false-bindings
4v-onehot-filter
4v-onehot-list-p
4v-onehot-rw-sexpr
4v-onehot-rw-sexpr-alist
4v-onehot-rw-sexpr-alist-aux
4v-onehot-sexpr-list-prime-exec
4v-onehot-sexpr-prime
4v-op-defs
4v-pat-alist-translate
4v-res
4v-sexpr-<=
4v-sexpr-alist-<=
4v-sexpr-alist-equiv
4v-sexpr-alist-equiv-witnessing
4v-sexpr-alist-extract
4v-sexpr-apply
4v-sexpr-boolean-rulesp
4v-sexpr-brules-p
4v-sexpr-compose
4v-sexpr-compose-alist
4v-sexpr-compose-list
4v-sexpr-compose-with-rw
4v-sexpr-compose-with-rw-alist
4v-sexpr-equiv
4v-sexpr-eval
4v-sexpr-eval-alist
4v-sexpr-eval-default
4v-sexpr-eval-default-alist
4v-sexpr-eval-default-list
4v-sexpr-eval-list
4v-sexpr-eval-list-list
4v-sexpr-fixpoint-lower-boundp
4v-sexpr-fixpoint-spec
4v-sexpr-fixpointp
4v-sexpr-fixpointp-witnessing
4v-sexpr-list-equiv
4v-sexpr-restrict
4v-sexpr-restrict-alist
4v-sexpr-restrict-list
4v-sexpr-restrict-with-rw
4v-sexpr-restrict-with-rw-alist
4v-sexpr-restrict-with-rw-list
4v-sexpr-rewrite-alistp
4v-sexpr-to-faig-apply
4v-sexpr-to-faig-list-fn
4v-sexpr-to-faig-opt
4v-sexpr-to-faig-plain
4v-sexpr-to-faig-plain-list
4v-sexpr-vars
4v-sexpr-vars-1pass-exec
4v-sexpr-vars-1pass-list-exec
4v-sexpr-vars-list
4v-sexpr-vars-list-list
4v-shannon-expansion-few
4v-unfloat
4v-wand
4v-wor
4v-xdet
4v-xor
4ve
4vec
4vec-
4vec-1mask
4vec-1mask-equiv
4vec-<
4vec-<<=
4vec-==
4vec->lower
4vec->upper
4vec-?
4vec-?!
4vec-?*
4vec-bit-extract
4vec-bit-index
4vec-bit-index-is-x
4vec-bit?
4vec-bit?!
4vec-bitand
4vec-bitand$
4vec-bitmux
4vec-bitnot
4vec-bitnot$
4vec-bitnot-to-4vec-bitxor
4vec-bitor
4vec-bitor$
4vec-bitxor
4vec-bitxor$
4vec-clog2
4vec-concat
4vec-concat$
4vec-concat$-to-logapp
4vec-correct-width-p
4vec-countones
4vec-equiv
4vec-fix
4vec-fix-is-4vec-of-fields
4vec-idx->4v
4vec-list
4vec-lsh
4vec-mask
4vec-mask-equiv
4vec-mask-to-zero
4vec-mask?
4vec-minus
4vec-muxtest-subsetp
4vec-offset
4vec-onehot
4vec-onehot0
4vec-onset
4vec-override
4vec-override-mux-<<=
4vec-override-mux-agrees
4vec-override-mux-ok
4vec-p
4vec-parity
4vec-part-install
4vec-part-select
4vec-part-select-of-4vec-bit?
4vec-plus
4vec-plus++
4vec-pow
4vec-quotient
4vec-reduction-and
4vec-reduction-or
4vec-remainder
4vec-res
4vec-res-must-choose-mask
4vec-resand
4vec-resor
4vec-rev-blocks
4vec-rsh
4vec-rsh-of-formula-checks
4vec-rsh-of-meta
4vec-shift-core
4vec-sign-ext
4vec-symwildeq
4vec-times
4vec-uminus
4vec-width-p
4vec-wildeq
4vec-wildeq-safe
4vec-x
4vec-x-count
4vec-x-override
4vec-xdet
4vec-z
4vec-zero-ext
4veclist-<<=
4veclist-fix
4veclist-from-bitlist
4veclist-mask
4veclist-p
4vecs
4vmask
4vmask-alist-fix
4vmask-alist-p
4vmask-fix
4vmask-p
4vmask-subsumes
4vmask-to-a4vec
4vmask-to-a4vec-rec
4vmask-to-a4vec-rec-env
4vmask-to-a4vec-varcount
4vmask-union
4vmasklist-len-fix
4vmasklist-subsumes
4vs-ite*-dumb
4vs-ite*-list-dumb
4vs-zif-dumb
5*Fib
5*pi
5+LENGTH
5-cube
512%nat
512-bit
51ul
52ul
56ul
5<=6/\a<=a/\
5=3\/i
5=x5&a1
5_or_greater
5ul
6-cube
63ul
64-bit
64-bit-mode-one-byte-opcode-modr/m-p$inline
64-bit-modep
64-bitp
64-tuples_on
64ul
65537i
65ul
6=x6&a1
6ul
7-cube
7=x7&a1
7_dot
7ul
8%nat
8*a1
8*a2-3*a3|^2
8-bit
8-cube
8192-bit
8\<rangle>v
8ul
9*a2*a1
96ul
<%1_F_Complex%>
<%>E
<%>E-succ_of
<%O
<%a
<%a%>
<%e%>
<%halt
<%i1
<%y%>
<%y%>^q
<*<*a
<*<*a*>*>
<*>A
<*>COMPLEX
<*>E
<*>I
<*>IAlph
<*>NAT
<*>REAL
<*>Vars
<*>the
<*A
<*A*>
<*A1
<*A1*>
<*A2
<*A2*>
<*Class
<*FALSE*>
<*Funcs
<*I1
<*I1*>
<*Jordan_block
<*NW-corner
<*RAT
<*SW-corner
<*TRUE*>
<*TheEqSymbOf
<*TheNorSymbOf
<*Y
<*Y*>
<*a
<*a*>
<*a1
<*a1*>
<*a2
<*a2*>
<*a9*>
<*a^2
<*am
<*an_Adj
<*ap
<*card
<*cin
<*da
<*dom
<*e
<*e*>
<*e1
<*e1*>
<*e2
<*e2*>
<*head
<*i
<*i*>
<*i+1*>
<*i1*>
<*l*>^phi
<*len
<*lower_bound
<*minusone*>
<*mlex*>
<*partdiff
<*pi_1
<*r*>|^a
<*root-label
<*the
<*top
<*u*>
<*x*>^<*y*>
<*xy
<*y
<*y*>
<*y*>/
<*y*>^T
<*y*>^q
<*y1
<+>\<^sub>Q
<+infty
<+ᵥ
<-*-/-left
<-*-/-right
<-*-left-cancel
<-*-left-cancel-old
<-*-right-cancel
<-*-right-cancel-old
<-*-y-x-y
<-0-+-negative-1
<-0-+-negative-2
<-0-expt-x-2
<->ₐ
<->ₛ
<-all
<-asym
<-decidable
<-insert
<-insertsort
<-irrefl
<-irrelevant
<-is-prop-valued
<-isStrictPartialOrder
<-isStrictTotalOrder
<-minus-zero
<-of-*-and-*-cancel
<-of-*-and-*-cancel-gen
<-of-*-and-*-same-forward-1
<-of-*-and-*-same-linear-1
<-of-*-of-/-arg1
<-of-*-of-/-arg1-arg1
<-of-*-of-/-arg2-arg1
<-of-*-of-expt-and-ash
<-of-expt-and-expt-same-base
<-of-if-arg2
<-of-log2-arg1
<-of-logior-and-expt-of-2
<-on-others
<-ordered-p
<-pkg-symbol-name-listp
<-preserved-by-adding-<-*pseudo-page-size-in-bytes*
<-split
<-strictPartialOrder
<-strictTotalOrder
<-string-all
<-string-all-keys
<-string-listp
<-succ
<-trans
<-unary-/-positive-left
<-unary-/-positive-right
<-weaken
<-y-*-x-y
<-y-*-y-x
<-ℕ
<-ℚ-ℚ-irrefl
<-≤-trans
<-𝕎
</code>
</li>
</pre></blockquote>
<<-asymmetric
<<-implies-lexorder
<<-irreflexive
<<-ordered-p
<<-sort
<<-transitive
<<-trichotomy
<<=-anti-symmetric
<<A>>
<<Y>>
<<a>>
<=%O
<=-all
<=-cancel
<=-full
<=-lists
<=-of-*-and-*-same-forward-1
<=-of-*-and-*-same-linear
<=-rationalp-Least-nat-bound-loop
<=-transitive
<=0_goto
<=>0<a
<=>A
<=>CARD
<=>i=1\/
<=E
<=Sum
<=_a
<=_o
<=a
<=a*
<=abs
<=dimindex
<=dist
<=i
<=len
<=location-all-witness
<=makespan
<=r*abs
<=scs_a_v39
<=seq
<=start_time
<=y
<>*u
<>0_goto
<>E
<>PI
<>a
<>e
<>y
<A
<CARD
<I
<Index
<LAD
<NAME>
<NAT
<PI
<REAL
<Suc
<\<^sub>C\<^sub>F\<^sub>
<\<^sub>l\<^sub>e\<^sub>x
<\<^sub>p
<\<^sub>r\<^sub>l\<^sub>e\<^sub>x
<\<^sub>v
<\<^sup>P
<\<lambda>
<\<lambda>_
<\<lambda>a
<\<lambda>r
<\<lambda>rs
<^a
<^a1
<^a2
<^a9
<^i
<^o
<^o1
<^o2
<^o3
<_A
<_O
<_a
<_a-Cancellation-Laws-for-*_a
<_a-cancellation-laws-for-+_a
<_o
<_o9
<_op
<_paco_0=
<_paco_1=
<_paco_2=
<_paco_3=
<_paco_4=
<_paco_5=
<_paco_6=
<_paco_7=
<a
<a>
<abs
<access>
<additional_tasks_start
<ai
<ai+1
<alist-call1>
<alist-call>
<b>Back
<bdd_relator
<blockquote><pre>
<bplustree_assn
<card
<catch>
<code>
<coerce-inverse-2-better>
<conclusion>
<data>
<def=
<dim_poly
<dim_row
<dim_vec
<e
<e1>
<e2>
<e3>
<emp>
<env>
<eps
<ev-list>
<ev>
<evl>
<evl>-meta-extract-global-facts
<export>
<field>
<file>
<fix>
<formal>
<formals>
<formula-check>
<fsmname>
<hypotheses>
<i
<i>
<i>*
<i>*sin_C/
<i>*x
<i>*y
<i>*z
<i>*z1
<i>*z2
<i>formula</i>
<i>name</i>
<id
<idxfix>
<inf
<init>
<int
<inv
<is_bdd_impl
<is_nf
<kind>
<len
<length
<length>
<lex
<li>@
<li>For
<lim
<list-call>
<logop>
<min
<nNodePipe
<na
<name>
<name>-min-max
<name>-overridekeys
<norm
<numerator
<o
<o>
<oH
<optional
<order
<p>A
<p>ACL2
<p>And
<p>As
<p>Before
<p>But
<p>Finally
<p>Fixed
<p>For
<p>Here
<p>However
<p>If
<p>In
<p>It
<p>Note
<p>Now
<p>See
<p>So
<p>That
<p>The
<p>Then
<p>These
<p>This
<p>To
<p>Use
<p>We
<p>When
<p>You
<p>and
<p>where
<p>which
<pa
<pi
<pre>
<pred>
<prefix>-object-alist-eval
<prefix>-object-eval
<prefix>-objectlist-eval
<pro_size
<progress
<quotient>
<range
<remainder>
<see
<seq
<signal>
<size
<specname>
<stobjname>
<stobjpred>
<sum-call1>
<term>
<u
<ucol
<ul>
<update>
<urow
<usual
<vebt_assn_raw
<weight_space_dim
<xvar>
<x≃y>
<y
<|As
<|I
<|IT
<|buffer
<|carrier
<|clock
<|cod
<|code
<|compile
<|compile_oracle
<|compiler_state
<|dom
<|entry_pc
<|globals
<|has_fp_ops
<|heap_prev
<|inf_v
<|inline_size_limit
<|input
<|io_trace
<|limits
<|locals
<|locals_old
<|locals_prev
<|locals_size
<|next
<|next_uvar
<|permute
<|pos
<|prev_node
<|proc
<|refs
<|regs
<|safe_for_space
<|source_conf
<|stack
<|stack_max
<|state
<|store
<|subst
<|the_type_constants
<|vars
<ᵇ
<ᵇ⇒<
<ᵗ
<ᵥ
<ᶜˡ
<ℕ
<ℤ
<→<ᵗ
=-cos
=-denominator
=-iff-subsetps
=-implies-=-*-1
=-implies-=-*-2
=-implies-=-+-2
=-implies-=_-
=-implies-equal-deg-a
=-implies-equal-deg-b
=-log
=-sin
=0_Rmatrix
=0_goto
=1_Rmatrix
=2*Fib
=2*sin
=2*sinh
=3/2*PI
=<*>MESSAGES
=<-perm
==-but
==-but-g-k
==>iff
==\<^sub>G
==\<^sub>L
==_e
==_e-C_==_e
==_e-implies-==_e-**_e-1
==additional_tasks_machine
==eps=>
==job
==machine
==n+nbVehicles-1
==n-nbCustomers
==n-nbCustomers-nbVehicles
==n-nbVehicles+1
==nDirNz2
==nbCustomers+1
==nbCustomers+2*nbVehicles
==objective
==vehicle
==x_O
=>i
=A
=A%B+A%C
=A*
=A*B
=A0
=ACirc
=A^op
=Arg
=Ball
=Build_Com_ob
=CARD
=CCirc
=Class
=ClightSem
=Col
=Del
=Det
=E
=E/\
=E1
=E1==>
=Elt
=EqClass
=Eve
=Exec
=FALSE
=FDprobability
=False
=False\<rparr>
=FinMeet
=FunSET2_l
=FunSET2_r
=F|A
=F|A/
=GenFib
=Goto
=Hxy
=HybridMachineSig
=I
=IExec
=IMAGE
=I_el
=Im
=Im1
=Im2
=Index
=Indices
=Inl
=Inr
=Int
=Integral
=LCirc
=LDir
=LSeg
=LeftComp
=Line
=Lucas
=MetricTopology
=Mx2Tran
=NAT
=None
=O
=O_
=O_F
=O_el
=Omega_F
=Op-Left
=Orte
=Ortm
=PI
=PI/2
=PProJ
=PSym
=Partial_Sums
=ProductTopology2
=REAL
=RTop
=R_EAL
=Re
=Rea
=ReadersWriters
=Reg
=Rev
=SCirc
=SOME
=SUC
=Seg
=SemSource
=SemTarget
=Shift
=Sigma
=Some
=Split64
=StepWhile>0
=Sum
=TRUE
=TankFlow
=Theta_F
=TopStruct
=Trace
=True
=True\<rparr>
=Type
=U
=U1
=UsedInt*Loc
=UsedIntLoc
=V_var
=Var
=Word
=Y
=ZeroGpd
=\<^bsub>P\<^esub>
=\<^bsub>\<Gamma>\<^esub>
=\<^bsub>\<alpha>\<^esub>
=\<^bsub>\<beta>\<^esub>
=\<^bsub>\<iota>\<^esub>
=\<^bsub>d\<^esub>
=\<^bsub>mds\<^esub>\<^sup>l
=\<^bsub>o\<^esub>
=\<^sub>F
=\<^sub>I
=\<^sub>N
=\<^sub>S
=\<^sub>\<alpha>
=\<^sub>f
=\<^sub>m
=\<^sub>p
=\<^sub>s
=\<^sup>*
=\<^sup>l
=\<cdot>
=_e
=_then
=a
=a*
=a*Det
=a*Fib
=a*b
=a*c
=a-x
=a/\
=a/b
=a2
=a3
=a5
=a6
=abs
=addcomplex
=aff_ge
=aff_gt
=angle
=arccos
=arcsin
=azim
=a|^
=a|^2*a-a|^2*b-
=a|^3-a|^2*b-
=b-a
=bool
=card
=cdecl
=coal
=compose_meminj
=constructor
=cos
=cos_C/
=cosh
=cosh1
=cosh2
=cpx2euc
=crossover
=d1_fan
=data
=default_tap_config
=denominator
=diff
=dist
=dom
=dryResources
=e
=e1
=e\<^sub>2
=elt
=env
=eqA
=euc2cpx
=exp
=exp_R
=f1_fan
=fexp
=fexpe_fexp
=fun
=goto
=guard
=hap
=hcflat
=i
=i1-
=i2
=i2-
=id
=ind
=indexf
=insert
=integral
=integral+
=inter
=intloc
=inv
=inverse1_sigma_fan
=it
=lcmlat
=len
=lhses
=lhses-of-rw
=lim
=lim_in+infty
=lim_in-infty
=lim_left
=lim_right
=list
=ln_beta
=loc
=log
=lower_bound
=max
=maxreal
=mid
=min
=minreal
=modetrans
=nat
=norm
=numerator
=o
=o_
=o_F
=objective
=ol
=option
=out
=partdiff
=perm
=post=
=prim_src_config
=proj1
=q*n-root
=r*diff
=reproj
=rhses
=rng_op
=round
=rseq
=seq
=seq1
=seq1+
=seq1-seq2-seq3
=seq19
=seq_id
=simp=>
=sin
=sinh
=smid
=stable_sy
=subdivision
=sum
=tag=
=tan
=tanh
=the
=threadPool
=tid
=true
=u
=union
=upper_bound
=vol
=whichV
=width
=x\<rangle>
=x\y
=y
=y1
=y\
=z\y
=Θ
=β
=β=>
=β=>*
=η=>
=ᵇ
=ᵐ
=ᵥ
=ᶠ
=ₛ
>-EVAL_TAC>>
>-METIS_TAC
>-all
>-full_simp_tac
>-intLib
>-metis_tac
>-monomio
>-simp
>-xsimpl
>0_goto
>=-len
>=0_goto
>=PI
>=_a
>=all
>=all-hyps
>=all-key
>=all-list
>>=\<^sub>M
>>BasicProvers
>>CCONTR_TAC>>
>>CCONTR_TAC>>fs
>>CONJ_TAC
>>Cases>>
>>Cases>>fs
>>Cases>>simp
>>Cases_on
>>Cases_on‘tr’>>fs
>>DECIDE_TAC
>>DEP_REWRITE_TAC
>>DISJ1_TAC>>
>>EVAL_TAC
>>EVAL_TAC>>
>>EVAL_TAC>>fs
>>EVAL_TAC>>rw
>>EVERY_CASE_TAC>>
>>EVERY_CASE_TAC>>fs
>>EVERY_CASE_TAC>>full_simp_tac
>>FULL_CASE_TAC>>fs
>>HINT_EXISTS_TAC>>fs
>>IF_CASES_TAC>>
>>IF_CASES_TAC>>fs
>>IF_CASES_TAC>>full_simp_tac
>>Induct>>fs
>>Induct_on
>>Know
>>LET_ELIM_TAC>>
>>LET_ELIM_TAC>>full_simp_tac
>>METIS_TAC
>>NO_TAC
>>PairCases_on
>>SET_TAC
>>TOP_CASE_TAC
>>TOP_CASE_TAC>>fs
>>TOP_CASE_TAC>>rw
>>TRY
>>\<^sup>*
>>completeInduct_on
>>disch_then
>>drule
>>eq_tac>>rw
>>every_case_tac
>>every_case_tac>>
>>every_case_tac>>fs
>>every_case_tac>>gs
>>every_case_tac>>gvs
>>every_case_tac>>rw
>>every_case_tac>>simp
>>first_assum
>>first_x_assum
>>fs1>>full_simp_tac
>>full_simp_tac
>>imp_res_tac
>>impl_tac
>>impl_tac>-
>>impl_tac>-metis_tac
>>intLib
>>irule
>>last_x_assum
>>metis_tac
>>ntac
>>pairarg_tac>>fs
>>pairarg_tac>>rw
>>pairarg_tac>>simp
>>pbrsem_tac>>
>>pop_assum
>>qexists_tac
>>qid_spec_tac‘cs’>>qid_spec_tac‘i’
>>qpat_abbrev_tac
>>qpat_x_assum
>>rename1
>>res_tac>>
>>res_tac>>fs
>>res_tac>>full_simp_tac
>>res_tac>>metis_tac
>>rev_full_simp_tac
>>rveq
>>rveq>>
>>rveq>>fs
>>rveq>>gs
>>simp
>>srw_tac
>>strip_tac
>>strip_tac>>
>>strip_tac>>fs
>>strip_tac>>gvs
>>strip_tac>>simp
>>unabbrev_all_tac>>
>>xif
>>xmatch
>>xmatch>>
>>xsimpl
>>xsimpl>>
>A
>Elt
>Ensf
>PI
>Qpositive
>Word
>\<^sub>C\<^sub>F\<^sub>
>\<^sub>p
>\<^sub>t
>\<^sub>u\<^sub>b
>_a
>a
>len
>nat
>restdays
>|A
?!u
?!y
?A
?E
?E1
?E2
?E3
?I
?R_FUNC
?U
?Y
?\<Delta>
?\<Gamma>
?\<lbrace>
?\<sigma>
?a
?a0
?a1
?a2
?aJ
?ad
?aenv
?aignet2
?alist
?ans
?args1
?aux
?ax
?base-env1
?bindings
?bindings1
?bo
?body
?bvar-bindings
?bvar-db1
?bvar-db2
?bytes
?case
?cbspace
?cnt-res
?code
?concl-bvar-db
?consts
?contradictionp
?copy
?correct
?ctMap
?curr
?decode
?del
?delta
?deps
?dont-rw
?e
?e0
?e1
?e2
?e3
?e4
?eaunused
?ec
?ec1
?ele
?env
?envA
?envmap1
?ep
?eps
?er
?erp
?err
?err1
?err2
?es
?ev
?ex
?exp
?exp2
?exps2
?extd
?extra
?fails
?fas
?ffi_names
?fi
?form
?fparams
?frames
?free
?genv
?gi
?gvar-bindings
?h_i
?ha
?heap2
?hom
?hyp-bfr
?hyp-bvar-db
?i
?i0
?i1
?i2
?i3
?id
?idx
?ienv
?ienv_res
?impl
?in_itv/=
?index
?init
?inits
?ins
?insts
?interp-st1
?invars
?io
?iv
?ix
?keys-out
?left
?len
?lines
?live1
?live2
?livein
?liveout
?loc
?mark
?match
?min
?name
?net
?new-aignet2
?new-bvar-db
?new-calist
?new-copy
?new-db
?new-factory
?new-hyp
?new-interp-st
?new-mark
?new-node
?new-sin
?new-st
?new-state
?new-strash
?new_code
?new_io
?newx
?next_state
?node
?nodesdb-res
?o2
?ok
?okp
?old
?op
?oracle
?order
?path
?pathcond1
?pay
?pc-sat
?perm
?pes
?phi
?phi0
?pi
?pos
?posS
?pre
?prefix
?prod
?prog
?psi
?r3i
?r4i
?refs
?refs1
?regvars
?remainder
?res
?res1
?res2
?res5
?result
?right
?roots2
?rty
?sa
?si
?start
?state
?state1
?sthout
?stout
?strash
?successp
?sum
?svexl-res
?symunion
?ta
?tag
?te
?thesis
?thesis1
?this_is_case
?tokstream
?top
?tw2i
?ty
?ty1
?u
?u0
?u1
?uf
?ul
?undo-info
?val
?vals
?var
?ve
?vlist
?w0i
?warnings
?wi
?wlist
?wo
?xminf
?y
?y0
?y1
?y2
?y3
?y4
?yl
?ys
?ys1
?α
?σ
@-\<^sub>B
@-\<^sub>S
@@HI~%\
@@auto
@@canon_attr
@@expect_failure
@@induct
@@plugin
@A
@A2P
@AddMonoidHom
@AddSubgroup
@Age_alg
@AlgHom
@Algebra
@BlankRel
@BorelSpace
@Bornology
@BoundedContinuousFunction
@Build_IsEquiv
@CInline
@CQCSub_All
@Canc_alg
@Cartesian
@CharP
@Closed
@Cocartesian
@Col
@CompilerCorrectness
@CompleteSpace
@Complex
@Compose
@Computation
@Concept-with-all-Objects
@Const
@Continuous
@ContinuousInv
@ContinuousLinearMap
@ContinuousMap
@ContinuousMul
@ContinuousOn
@ContinuousSMul
@Countable
@CountablyGenerated
@Cross_alg
@DFinsupp
@DFunLike
@Datatypes
@Decidable_witness
@DeepEmbedded
@DeltaGeneratedSpace
@DiscreteTopology
@Disjoint
@DownwardsClosedSeparationAlgebra
@E
@EFin
@ENNReal
@Encodable
@Eq
@EqDec
@Equiv
@Equivalence
@Etale
@Exists
@ExtendPathTermAlgebra
@ExtendRelTermAlgebra
@Fact
@Faithful
@Filter
@Fin
@FinCategory
@Finite
@FinitePresentation
@Finite_elements
@Finset
@Finsupp
@Fintype
@Flat
@FlatSemantics
@Forall2
@FormallyUnramified
@Freezer
@Function
@FunctionalExtensionality
@Functor
@GRing
@GaloisConnection
@GenSizedSuchThatSizeMonotonicOpt
@Globalenvs
@GradedMonoid
@Handler
@HasEval
@Hconcat
@Hnil
@Hom
@HomRel
@Homeomorph
@IH
@ITree
@Ideal
@In
@IncreasingSeparationAlgebra
@Infinite
@Initial
@Injective
@Int
@IsAffineHom
@IsBounded
@IsClosedImmersion
@IsClosedMap
@IsColimit
@IsEquiv
@IsFinite
@IsImmersion
@IsInducing
@IsIntegralHom
@IsIsomorphism
@IsLimit
@IsLocalIso
@IsLocalization
@IsLower
@IsOpenImmersion
@IsOpenMap
@IsPlot
@IsPreimmersion
@IsProper
@IsScalarTower
@IsScott
@IsSeparated
@IsTerminal
@IsTopologicalAddGroup
@IsTopologicalGroup
@IsUltraUniformity
@IsUniformGroup
@Isomorphic
@Isomorphism
@Itv
@JMeq
@Join_discrete
@Join_equiv
@Join_lower
@Kernel
@Kmodel
@Krelation
@LE
@LawfulFunctor
@LaxMonoidalFunctor
@Leaf
@LiftLift
@LinearMap
@List
@LocallyConvexSpace
@LocallyOfFinitePresentation
@LocallyOfFiniteType
@Mapping
@Measurable
@MeasurableSet
@Measure
@Mem
@MemSem
@Meta
@Module
@Monad
@Monoid
@MonoidHom
@Monoidal
@MulEquiv
@Multiset
@Nat
@NaturalTransformation
@Naturality
@Neg
@NonarchimedeanRing
@None
@Norm
@Num
@OC_Bind
@OInv_Can
@OInv_CanV
@OK_spec
@OK_ty
@Opens
@Option
@OrderBot
@OrderDual
@OrderTop
@PFun
@PLift
@PTree
@P_init
@PadicSeq
@Partrec
@Path
@Perm_alg
@Permutation
@Pi
@PolishSpace
@Pow
@PresheafedSpace
@Primrec
@Prod
@Profinite
@Proper
@QuasiCompact
@Quiver
@Quot
@Quotient
@QuotientGroup
@RCLike
@Rat
@RelIso
@RelMap
@ResidualSeparationAlgebra
@RestrictSub
@Ring
@RingEquiv
@RingHom
@SecondCountableTopology
@Sep_alg
@Sep_prod
@SeparatesPoints
@SeparationAlgebraAbsorbStable
@SeparationQuotient
@Seq
@SequentialSpace
@Set
@Setoid
@Sigma
@SimpleFunc
@Sized
@Smallstep
@Smooth
@Some
@Sub
@Subgroup
@Subsingleton
@Subtype
@Sum
@Surjective
@SurjectiveOnStalks
@Terminal
@TotalSpace
@Tpoint
@Trans
@Transform
@TraverseFunctorial
@TraverseIdentifiesVar
@TraverseRelative
@TraverseVarInjective
@TraverseVarIsIdentity
@U
@ULift
@ULiftHom
@UM
@Ultrafilter
@UniformContinuous
@UniformEquiv
@UniformSpace
@Unique
@UnitalSeparationAlgebra
@Units
@UniversallyClosed
@UniversallyOpen
@UpwardsClosedSeparationAlgebra
@Vec
@Vector
@WeaklyEtale
@WellFounded
@WellFoundedRelation
@WittVector
@X86Sem
@Zigzag
@\<^sub>c
@\<^sub>l
@\<^sub>r
@\<^sub>v
@\<acute>
@__reduce__
@_a
@a
@a#as
@a1
@abbreviate
@acos
@add
@age1
@algebraMap
@algebraMap_smul
@align_compatible_rec
@alignof
@all
@all-formals
@all_finite
@and_comm
@and_left_comm
@andp
@any_finite
@ap
@app
@arbitraryST
@arbitrarySizeST
@arg-lst
@args
@args1
@asIso
@asin
@associative
@assumptions
@atTop
@atan
@better-invariant-formals
@bind
@bindings
@bitp
@borel
@boundedLimitRecOn
@bounded_func_op
@bounded_map
@bounded_mem
@ca_eof
@card
@cast_mono
@cast_ord
@cat_postcomp
@cat_precomp
@cenv_cs
@cfRepr
@checker
@closed
@closure
@cmp_compares
@coeHom
@coe_top
@coeq
@cofinite
@commutative
@comp_map
@comp_spec
@compose
@concat
@condDistrib
@connection-predicate-formals
@connection-relation-formals
@cons
@const
@continuous_id
@contract
@core
@cos
@cs_eof
@curry
@dat_exists
@data
@data_at
@data_at_
@data_block
@decode
@default
@deltaGenerated
@denote_list
@derivable
@diluteMem
@disabled-runes
@dist
@dist_eq_norm_vsub
@dist_nonneg
@dlet
@down
@e
@e1
@e2
@embed
@emp
@empty
@encode
@entourage
@enum_val
@env_coherence
@eq
@eq_comm
@eq_itree
@eq_map
@eq_op
@eq_rel
@eqb
@eqit
@eqit_
@eqit_secure
@eqp
@equi
@equiv
@equiv_hlist
@eqv
@esym
@eutt
@eval
@evalDet_dec
@ex
@existT
@exists_comm
@exl
@exp
@expR
@expected_poly_time_compose
@expected_poly_time_compose_binary
@expected_poly_time_compose_simp
@expl
@exprz
@exr
@ext_num_sem
@extra-args
@extra-vars
@extraction
@ffun_add
@field_at
@field_at_
@field_compatible
@filter
@finSub
@fin_lt
@fin_num
@find
@fine
@finst
@fintype
@fixInduction
@fixed-formal-bindings
@flip
@fmap
@forall_comm
@forall_swap
@formals
@formals-in-invar
@fourier
@fourierLp
@fset0
@fsim_properties_ext
@fsim_properties_inj
@fun
@funMap
@fun_induct
@func
@getSt
@getThreadC
@getThreadR
@get_co
@h_map
@ha
@haarAddCircle
@harmonic
@have
@hi
@hints
@hlist_hrel
@hyps
@i
@i1
@i2
@i3
@iInter_comm
@iSup_comm
@iUnion_comm
@i_pointwise
@id
@identity
@idfun
@ih
@iinv
@image_univ
@in_filter
@incl
@increasing
@induct
@induction
@inf_le_left
@inf_le_right
@inl
@inline
@inline_let
@inner_self_eq_norm_mul_norm
@inner_self_eq_zero
@inputs
@inr
@ins
@insert
@insertRec
@instantiation-fns
@integerp
@interchange
@interp
@interp_imp
@inv
@inverse
@involutive
@isIso_of_reflects_iso
@isUnit_of_invertible
@iso_equiv
@java
@join
@join_sub
@jsafeN
@jsafe_phi
@keyed_pred
@keypairs
@later
@laterR
@lb_step_failure
@lb_step_ordered_dynamic_failure
@lb_step_ordered_failure
@le_sup
@left_commutative
@left_distributive
@left_id
@legendreSym
@length
@level
@lift
@liftx
@lim
@limUnder
@lim_inf
@lim_sup
@limitRecOn
@link_list
@list-args
@loc
@logand
@loghead
@logior
@ltac_something
@mach-o
@map
@map-formals
@matrix
@maybe-new-state
@maybe-state
@measurable
@measurable_const
@meet
@meminj_preserves_globals
@minpoly
@model
@model_trace
@morphism_isomorphic
@mul
@mulmx
@mxmodule
@nargs
@necR
@nested_field_type
@network
@new-formals
@new-formals-in-terms-of-old
@next
@nil
@no_output_at_backup_trace
@node
@none
@norm
@norm_add_mul_self
@norm_sub_mul_self
@nsmulRec
@obseq
@oc_comp_spec_eq
@ocitv
@of
@ofConv
@ofLp
@ofReal_inj
@old-vars-in-explanations
@old-vars-in-invar
@open
@option_le
@ord
@orp
@own
@p_morphism_of
@pair
@param
@params
@path_forall
@paths
@pcancel
@personal_mem
@piSetoid
@pointwise_relation
@powersetCard
@precondition
@prod
@prod_Join
@proj
@proof
@prop
@prop_induct
@provable
@proved-final-claim-formals
@pseries
@pullback
@pure
@qed
@ratr
@real
@reassoc_seq_asm_exc
@recTopCoe
@refl_trans_1n_trace_trans
@regular_space
@rel_asm
@remove_events
@reptype
@restrPermMap
@result
@ret
@return
@rev
@rev_right_loop
@reverse
@right_commutative
@right_distributive
@right_loop
@runes
@rutt
@sa_distributive
@section_repr
@semax
@semax_body
@semax_prog
@send_packets
@sepcon
@set
@set-constr
@set0
@setI
@setT
@setU
@setY
@sigT
@signed-byte-p
@sin
@size
@sizeof
@sizes
@snoc
@some
@spin
@split_fin_sum
@stack
@state_eq
@state_eq_eutt
@step
@step-calls
@step_async
@step_async_star
@step_failure
