0
1
2
3
4
5
a
ab
ac
acc
and
app
apply
argument
as
assert
assoc
assumption
auto
b
backward
base
bc
by
c
case
cases
choose
classic
comm
compat
conjunction
contra
contradiction
curry
d
dependent
destruct
direction
disjunction
distr
e
eq
eqn
equalities
even
exact
exactly
excluded
exfalso
f
factorial
false
faster
filter
fold
forall
forward
from
fx
g
ge
generalize
goal
goals
grows
h
h1
h3
have
holds
hypotheses
hypothesis
ih
imp
implication
impossible
in
induction
inductive
into
intro
introduce
intros
inversion
is
l
l1
l2
l3
le
left
lem
length
lia
list
m
map
middle
mp
mult
n
nat
need
nil
nm
not
now
o
odd
of
on
or
p
plus
polynomial
power
proposition
propositions
prove
provide
r
rearrange
refl
reflexivity
result
rev
rewrite
right
ring
rw
s
show
side
simp
simpl
since
sm
so
solves
split
ss
sub
sum
t
tactic
terms
the
this
to
trans
true
two
unfold
use
using
we
with
x
declare
int
spdx
const
license
identifier
pmpl
later
logic
set
jewell
check
sat
file
for
echidna
example
jonathan
2026
qf_lia
ephapax
proofs
status
claim
theorem
basic
universal
open
filecopyrighttext
2025
tests
smt
lib
hyperpolymath
copyright
variables
simple
linear
lean
fun
agda
all
proof
system
type
minimal
bitvec
function
monotonic
quantifiers
property
quantification
propositional
cnf
sort
typing
semantics
bruijn
arithmetic
memory
backend
integer
constraints
add
satisfiable
that
qf_bv
region
each
qf_nia
small
wff
bvxor
cons
exists
expected
pigeon
demonstrating
fundamental
project
team
logical
substitution
idr
level
xor
mit
stdlib
identity
demonstrates
qf_uf
coq
patterns
foundation
step
advanced
judgement
operational
safe
based
proves
formal
rules
management
includin
reduc
fusion
core
statu
syntax
first
syllogis
fof
classical
form
order
safety
socrates
modus_ponens
tptp
transitivity
less
than
prover
disp
dispatchcorrectness
group_left_identity
dyadic
binding
formalises
qualifiers
regions
compile
axiom
disjunction_elim
cleanly
disjunctio
prop
mvp
known
equality
trivial
double_negation
against
identitylaws
runner
symmetry_eq
echidnabot
exercise
sym
holes
hole
vars
unsat
means
solution
some
p_i_h
instance
bvand
pigeons
pigeonhole
unsatisfiable
import
module
indexed
vertices
array
k_3
colours
encoded
qf_ax
clauses
triangle
vertex
store
clause
chain
colouring
select
contained
self
very
constants
tiny
metamath
datatypes
bv0
real
qf_nra
bvadd
where
data
over
lemma
val
let
totality
natural
zero
impo
suc
countersatisfiable
uses
manipulation
number
principles
empty
populate
correct
add_comm
dir
under
intuitionistic
idris2
elim
abs_nonneg
verify
source
mul_zero
basictotality
add_assoc
mulzero
fstar
mapp
dispatch
mnt
var
addcomm
terminates
stage
confidence
eclipse
rule
linearity
mul
axioms
preserves
executes
nonneg
kind_to_u8
certs
transitions
lean4
repos
pipeline
tracker
borrow
confidencelattice
sandbox
verification
then
axiomcompleteness
proverkindinjectivity
add_commutes
prevents
guard
invalid
else
addassoc
integrity
dispatchordering
strictly
